# FailureDefinitionRegistry Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FailureDefinitionRegistry Members
FailureDefinitionRegistry Class Methods Properties See Also
---
The FailureDefinitionRegistry type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FailureDefinitionRegistry |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| FindFailureDefinition | Finds a specific FailureDefinition by a given FailureDefinitionId. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ListAllFailureDefinitions | Retrieves all the registered FailureDefinitions. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FailureDefinitionRegistry Class
Autodesk.Revit.DB Namespace